Product/trunk/DDPs/NetworkResourceFulfillment/IIS/xml/notify-RouteChange.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:nam="http://www.tmforum.org/mtop/fmw/xsd/nam/v1" xmlns:gen="http://www.tmforum.org/mtop/fmw/xsd/gen/v1" xsi:schemaLocation="http://www.tmforum.org/mtop/nrf/xsd/routec/v1 ../xsd/RouteChangeEvent.xsd http://www.tmforum.org/mtop/fmw/xsd/notmsg/v1 ../../../Framework/IIS/xsd/NotificationMessages.xsd http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header>
    <m:header xmlns:m="http://www.tmforum.org/mtop/fmw/xsd/hdr/v1">
      <m:activityName>Notification</m:activityName>
      <m:msgName>notify</m:msgName>
      <m:msgType>REQUEST</m:msgType>
      <m:senderURI>http://www.altova.com</m:senderURI>
      <m:destinationURI>http://www.altova.com</m:destinationURI>
      <m:security>String</m:security>
      <m:securityType>String</m:securityType>
      <m:priority>String</m:priority>
      <m:msgSpecificProperties>
        <m:property>
          <m:propName>String</m:propName>
          <m:propValue>String</m:propValue>
        </m:property>
      </m:msgSpecificProperties>
      <m:communicationPattern>Notification</m:communicationPattern>
      <m:communicationStyle>RPC</m:communicationStyle>
      <m:timestamp>2001-12-17T09:30:47.0Z</m:timestamp>
      <m:vendorExtensions/>
    </m:header>
  </SOAP-ENV:Header>
  <SOAP-ENV:Body>
    <m:notify xmlns:m="http://www.tmforum.org/mtop/fmw/xsd/notmsg/v1">
      <m:topic>String</m:topic>
      <m:message>
        <m0:routeChange xmlns:m0="http://www.tmforum.org/mtop/nrf/xsd/routec/v1" xmlns:m1="http://www.tmforum.org/mtop/fmw/xsd/cei/v1" xmlns:m2="http://www.tmforum.org/mtop/fmw/xsd/ei/v1">
          <m1:notificationId>String</m1:notificationId>
          <m1:sourceTime>2001-12-17T09:30:47.0Z</m1:sourceTime>
          <m1:vendorExtensions/>
          <m2:objectName>
            <nam:rdn>
              <nam:type>MD</nam:type>
              <nam:value>Company/String</nam:value>
            </nam:rdn>
            <nam:rdn>
              <nam:type>ME</nam:type>
              <nam:value>String</nam:value>
            </nam:rdn>
          </m2:objectName>
          <m2:osTime>2001-12-17T09:30:47.0Z</m2:osTime>
          <m0:routeChangeEvent>RerouteCompleted</m0:routeChangeEvent>
          <m0:route xmlns:m4="http://www.tmforum.org/mtop/nrf/xsd/route/v1">
            <m4:ccList xmlns:m5="http://www.tmforum.org/mtop/nrf/xsd/cc/v1">
              <!-- Empty CrossConnect pseudo-objects for documentation purpose only -->
              <m5:cc/>
              <m5:cc/>
            </m4:ccList>
          </m0:route>
        </m0:routeChange>
      </m:message>
    </m:notify>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
